# SlopeArrowLevelEnd Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SlopeArrowLevelEnd Property
ParameterTypeId Class See Also
---
"Level at Head"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SlopeArrowLevelEnd { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlopeArrowLevelEnd As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlopeArrowLevelEnd {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace